---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LabelOverconstrained
source: html/0ccdba6f-4718-074b-2bd7-e23029489fa8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LabelOverconstrained Property

Labeling this dimension would overconstrain the sketch.

## Syntax (C#)
```csharp
public static FailureDefinitionId LabelOverconstrained { get; }
```